GopalSaraf/Practicals/PSDL/include/proc/pic18f2682.inc
// Register: B0D5
#define B0D5 B0D5
B0D5                                     equ 0E2Bh
// bitfield definitions
B0D5_B0D50_POSN                          equ 0000h
B0D5_B0D50_POSITION                      equ 0000h
B0D5_B0D50_SIZE                          equ 0001h
B0D5_B0D50_LENGTH                        equ 0001h
B0D5_B0D50_MASK                          equ 0001h
B0D5_B0D51_POSN                          equ 0001h
B0D5_B0D51_POSITION                      equ 0001h
B0D5_B0D51_SIZE                          equ 0001h
B0D5_B0D51_LENGTH                        equ 0001h
B0D5_B0D51_MASK                          equ 0002h
B0D5_B0D52_POSN                          equ 0002h
B0D5_B0D52_POSITION                      equ 0002h
B0D5_B0D52_SIZE                          equ 0001h
B0D5_B0D52_LENGTH                        equ 0001h
B0D5_B0D52_MASK                          equ 0004h
B0D5_B0D53_POSN                          equ 0003h
B0D5_B0D53_POSITION                      equ 0003h
B0D5_B0D53_SIZE                          equ 0001h
B0D5_B0D53_LENGTH                        equ 0001h
B0D5_B0D53_MASK                          equ 0008h
B0D5_B0D54_POSN                          equ 0004h
B0D5_B0D54_POSITION                      equ 0004h
B0D5_B0D54_SIZE                          equ 0001h
B0D5_B0D54_LENGTH                        equ 0001h
B0D5_B0D54_MASK                          equ 0010h
B0D5_B0D55_POSN                          equ 0005h
B0D5_B0D55_POSITION                      equ 0005h
B0D5_B0D55_SIZE                          equ 0001h
B0D5_B0D55_LENGTH                        equ 0001h
B0D5_B0D55_MASK                          equ 0020h
B0D5_B0D56_POSN                          equ 0006h
B0D5_B0D56_POSITION                      equ 0006h
B0D5_B0D56_SIZE                          equ 0001h
B0D5_B0D56_LENGTH                        equ 0001h
B0D5_B0D56_MASK                          equ 0040h
B0D5_B0D57_POSN                          equ 0007h
B0D5_B0D57_POSITION                      equ 0007h
B0D5_B0D57_SIZE                          equ 0001h
B0D5_B0D57_LENGTH                        equ 0001h
B0D5_B0D57_MASK                          equ 0080h

// Register: B0D6
#define B0D6 B0D6
B0D6                                     equ 0E2Ch
// bitfield definitions
B0D6_B0D60_POSN                          equ 0000h
B0D6_B0D60_POSITION                      equ 0000h
B0D6_B0D60_SIZE                          equ 0001h
B0D6_B0D60_LENGTH                        equ 0001h
B0D6_B0D60_MASK                          equ 0001h
B0D6_B0D61_POSN                          equ 0001h
B0D6_B0D61_POSITION                      equ 0001h
B0D6_B0D61_SIZE                          equ 0001h
B0D6_B0D61_LENGTH                        equ 0001h
B0D6_B0D61_MASK                          equ 0002h
B0D6_B0D62_POSN                          equ 0002h
B0D6_B0D62_POSITION                      equ 0002h
B0D6_B0D62_SIZE                          equ 0001h
B0D6_B0D62_LENGTH                        equ 0001h
B0D6_B0D62_MASK                          equ 0004h
B0D6_B0D63_POSN                          equ 0003h
B0D6_B0D63_POSITION                      equ 0003h
B0D6_B0D63_SIZE                          equ 0001h
B0D6_B0D63_LENGTH                        equ 0001h
B0D6_B0D63_MASK                          equ 0008h
B0D6_B0D64_POSN                          equ 0004h
B0D6_B0D64_POSITION                      equ 0004h
B0D6_B0D64_SIZE                          equ 0001h
B0D6_B0D64_LENGTH                        equ 0001h
B0D6_B0D64_MASK                          equ 0010h
B0D6_B0D65_POSN                          equ 0005h
B0D6_B0D65_POSITION                      equ 0005h
B0D6_B0D65_SIZE                          equ 0001h
B0D6_B0D65_LENGTH                        equ 0001h
B0D6_B0D65_MASK                          equ 0020h
B0D6_B0D66_POSN                          equ 0006h
B0D6_B0D66_POSITION                      equ 0006h
B0D6_B0D66_SIZE                          equ 0001h
B0D6_B0D66_LENGTH                        equ 0001h
B0D6_B0D66_MASK                          equ 0040h
B0D6_B0D67_POSN                          equ 0007h
B0D6_B0D67_POSITION                      equ 0007h
B0D6_B0D67_SIZE                          equ 0001h
B0D6_B0D67_LENGTH                        equ 0001h
B0D6_B0D67_MASK                          equ 0080h

// Register: B0D7
#define B0D7 B0D7
B0D7                                     equ 0E2Dh
// bitfield definitions
B0D7_B0D70_POSN                          equ 0000h
B0D7_B0D70_POSITION                      equ 0000h
B0D7_B0D70_SIZE                          equ 0001h
B0D7_B0D70_LENGTH                        equ 0001h
B0D7_B0D70_MASK                          equ 0001h
B0D7_B0D71_POSN                          equ 0001h
B0D7_B0D71_POSITION                      equ 0001h
B0D7_B0D71_SIZE                          equ 0001h
B0D7_B0D71_LENGTH                        equ 0001h
B0D7_B0D71_MASK                          equ 0002h
B0D7_B0D72_POSN                          equ 0002h
B0D7_B0D72_POSITION                      equ 0002h
B0D7_B0D72_SIZE                          equ 0001h
B0D7_B0D72_LENGTH                        equ 0001h
B0D7_B0D72_MASK                          equ 0004h
B0D7_B0D73_POSN                          equ 0003h
B0D7_B0D73_POSITION                      equ 0003h
B0D7_B0D73_SIZE                          equ 0001h
B0D7_B0D73_LENGTH                        equ 0001h
B0D7_B0D73_MASK                          equ 0008h
B0D7_B0D74_POSN                          equ 0004h
B0D7_B0D74_POSITION                      equ 0004h
B0D7_B0D74_SIZE                          equ 0001h
B0D7_B0D74_LENGTH                        equ 0001h
B0D7_B0D74_MASK                          equ 0010h
B0D7_B0D75_POSN                          equ 0005h
B0D7_B0D75_POSITION                      equ 0005h
B0D7_B0D75_SIZE                          equ 0001h
B0D7_B0D75_LENGTH                        equ 0001h
B0D7_B0D75_MASK                          equ 0020h
B0D7_B0D76_POSN                          equ 0006h
B0D7_B0D76_POSITION                      equ 0006h
B0D7_B0D76_SIZE                          equ 0001h
B0D7_B0D76_LENGTH                        equ 0001h
B0D7_B0D76_MASK                          equ 0040h
B0D7_B0D77_POSN                          equ 0007h
B0D7_B0D77_POSITION                      equ 0007h
B0D7_B0D77_SIZE                          equ 0001h
B0D7_B0D77_LENGTH                        equ 0001h
B0D7_B0D77_MASK                          equ 0080h

// Register: CANSTAT_RO9
#define CANSTAT_RO9 CANSTAT_RO9
CANSTAT_RO9                              equ 0E2Eh
// bitfield definitions
CANSTAT_RO9_EICODE0_POSN                 equ 0000h
CANSTAT_RO9_EICODE0_POSITION             equ 0000h
CANSTAT_RO9_EICODE0_SIZE                 equ 0001h
CANSTAT_RO9_EICODE0_LENGTH               equ 0001h
CANSTAT_RO9_EICODE0_MASK                 equ 0001h
CANSTAT_RO9_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO9_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO9_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO9_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO9_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO9_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_RO9_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_RO9_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_RO9_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_RO9_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_RO9_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_RO9_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_RO9_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_RO9_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_RO9_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_RO9_EICODE4_POSN                 equ 0004h
CANSTAT_RO9_EICODE4_POSITION             equ 0004h
CANSTAT_RO9_EICODE4_SIZE                 equ 0001h
CANSTAT_RO9_EICODE4_LENGTH               equ 0001h
CANSTAT_RO9_EICODE4_MASK                 equ 0010h
CANSTAT_RO9_OPMODE0_POSN                 equ 0005h
CANSTAT_RO9_OPMODE0_POSITION             equ 0005h
CANSTAT_RO9_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO9_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO9_OPMODE0_MASK                 equ 0020h
CANSTAT_RO9_OPMODE1_POSN                 equ 0006h
CANSTAT_RO9_OPMODE1_POSITION             equ 0006h
CANSTAT_RO9_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO9_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO9_OPMODE1_MASK                 equ 0040h
CANSTAT_RO9_OPMODE2_POSN                 equ 0007h
CANSTAT_RO9_OPMODE2_POSITION             equ 0007h
CANSTAT_RO9_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO9_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO9_OPMODE2_MASK                 equ 0080h
CANSTAT_RO9_ICODE0_POSN                  equ 0000h
CANSTAT_RO9_ICODE0_POSITION              equ 0000h
CANSTAT_RO9_ICODE0_SIZE                  equ 0001h
CANSTAT_RO9_ICODE0_LENGTH                equ 0001h
CANSTAT_RO9_ICODE0_MASK                  equ 0001h
CANSTAT_RO9_ICODE1_POSN                  equ 0001h
CANSTAT_RO9_ICODE1_POSITION              equ 0001h
CANSTAT_RO9_ICODE1_SIZE                  equ 0001h
CANSTAT_RO9_ICODE1_LENGTH                equ 0001h
CANSTAT_RO9_ICODE1_MASK                  equ 0002h
CANSTAT_RO9_ICODE2_POSN                  equ 0002h
CANSTAT_RO9_ICODE2_POSITION              equ 0002h
CANSTAT_RO9_ICODE2_SIZE                  equ 0001h
CANSTAT_RO9_ICODE2_LENGTH                equ 0001h
CANSTAT_RO9_ICODE2_MASK                  equ 0004h
CANSTAT_RO9_ICODE3_POSN                  equ 0003h
CANSTAT_RO9_ICODE3_POSITION              equ 0003h
CANSTAT_RO9_ICODE3_SIZE                  equ 0001h
CANSTAT_RO9_ICODE3_LENGTH                equ 0001h
CANSTAT_RO9_ICODE3_MASK                  equ 0008h
CANSTAT_RO9_ICODE4_POSN                  equ 0004h
CANSTAT_RO9_ICODE4_POSITION              equ 0004h
CANSTAT_RO9_ICODE4_SIZE                  equ 0001h
CANSTAT_RO9_ICODE4_LENGTH                equ 0001h
CANSTAT_RO9_ICODE4_MASK                  equ 0010h

// Register: CANCON_RO9
#define CANCON_RO9 CANCON_RO9
CANCON_RO9                               equ 0E2Fh
// bitfield definitions
CANCON_RO9_FP0_POSN                      equ 0000h
CANCON_RO9_FP0_POSITION                  equ 0000h
CANCON_RO9_FP0_SIZE                      equ 0001h
CANCON_RO9_FP0_LENGTH                    equ 0001h
CANCON_RO9_FP0_MASK                      equ 0001h
CANCON_RO9_WIN0_FP1_POSN                 equ 0001h
CANCON_RO9_WIN0_FP1_POSITION             equ 0001h
CANCON_RO9_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO9_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO9_WIN0_FP1_MASK                 equ 0002h
CANCON_RO9_WIN1_FP2_POSN                 equ 0002h
CANCON_RO9_WIN1_FP2_POSITION             equ 0002h
CANCON_RO9_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO9_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO9_WIN1_FP2_MASK                 equ 0004h
CANCON_RO9_WIN2_FP3_POSN                 equ 0003h
CANCON_RO9_WIN2_FP3_POSITION             equ 0003h
CANCON_RO9_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO9_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO9_WIN2_FP3_MASK                 equ 0008h
CANCON_RO9_ABAT_POSN                     equ 0004h
CANCON_RO9_ABAT_POSITION                 equ 0004h
CANCON_RO9_ABAT_SIZE                     equ 0001h
CANCON_RO9_ABAT_LENGTH                   equ 0001h
CANCON_RO9_ABAT_MASK                     equ 0010h
CANCON_RO9_REQOP0_POSN                   equ 0005h
CANCON_RO9_REQOP0_POSITION               equ 0005h
CANCON_RO9_REQOP0_SIZE                   equ 0001h
CANCON_RO9_REQOP0_LENGTH                 equ 0001h
CANCON_RO9_REQOP0_MASK                   equ 0020h
CANCON_RO9_REQOP1_POSN                   equ 0006h
CANCON_RO9_REQOP1_POSITION               equ 0006h
CANCON_RO9_REQOP1_SIZE                   equ 0001h
CANCON_RO9_REQOP1_LENGTH                 equ 0001h
CANCON_RO9_REQOP1_MASK                   equ 0040h
CANCON_RO9_REQOP2_POSN                   equ 0007h
CANCON_RO9_REQOP2_POSITION               equ 0007h
CANCON_RO9_REQOP2_SIZE                   equ 0001h
CANCON_RO9_REQOP2_LENGTH                 equ 0001h
CANCON_RO9_REQOP2_MASK                   equ 0080h
CANCON_RO9_WIN0_POSN                     equ 0001h
CANCON_RO9_WIN0_POSITION                 equ 0001h
CANCON_RO9_WIN0_SIZE                     equ 0001h
CANCON_RO9_WIN0_LENGTH                   equ 0001h
CANCON_RO9_WIN0_MASK                     equ 0002h
CANCON_RO9_WIN1_POSN                     equ 0002h
CANCON_RO9_WIN1_POSITION                 equ 0002h
CANCON_RO9_WIN1_SIZE                     equ 0001h
CANCON_RO9_WIN1_LENGTH                   equ 0001h
CANCON_RO9_WIN1_MASK                     equ 0004h
CANCON_RO9_WIN2_POSN                     equ 0003h
CANCON_RO9_WIN2_POSITION                 equ 0003h
CANCON_RO9_WIN2_SIZE                     equ 0001h
CANCON_RO9_WIN2_LENGTH                   equ 0001h
CANCON_RO9_WIN2_MASK                     equ 0008h

// Register: B1CON
#define B1CON B1CON
B1CON                                    equ 0E30h
// bitfield definitions
B1CON_FILHIT0_TXPRI0_POSN                equ 0000h
B1CON_FILHIT0_TXPRI0_POSITION            equ 0000h
B1CON_FILHIT0_TXPRI0_SIZE                equ 0001h
B1CON_FILHIT0_TXPRI0_LENGTH              equ 0001h
B1CON_FILHIT0_TXPRI0_MASK                equ 0001h
B1CON_FILHIT1_TXPRI1_POSN                equ 0001h
B1CON_FILHIT1_TXPRI1_POSITION            equ 0001h
B1CON_FILHIT1_TXPRI1_SIZE                equ 0001h
B1CON_FILHIT1_TXPRI1_LENGTH              equ 0001h
B1CON_FILHIT1_TXPRI1_MASK                equ 0002h
B1CON_FILHIT2_RTREN_POSN                 equ 0002h
B1CON_FILHIT2_RTREN_POSITION             equ 0002h
B1CON_FILHIT2_RTREN_SIZE                 equ 0001h
B1CON_FILHIT2_RTREN_LENGTH               equ 0001h
B1CON_FILHIT2_RTREN_MASK                 equ 0004h
B1CON_FILHIT3_TXREQ_POSN                 equ 0003h
B1CON_FILHIT3_TXREQ_POSITION             equ 0003h
B1CON_FILHIT3_TXREQ_SIZE                 equ 0001h
B1CON_FILHIT3_TXREQ_LENGTH               equ 0001h
B1CON_FILHIT3_TXREQ_MASK                 equ 0008h
B1CON_FILHIT4_TXERR_POSN                 equ 0004h
B1CON_FILHIT4_TXERR_POSITION             equ 0004h
B1CON_FILHIT4_TXERR_SIZE                 equ 0001h
B1CON_FILHIT4_TXERR_LENGTH               equ 0001h
B1CON_FILHIT4_TXERR_MASK                 equ 0010h
B1CON_RXRTRRO_TXLARB_POSN                equ 0005h
B1CON_RXRTRRO_TXLARB_POSITION            equ 0005h
B1CON_RXRTRRO_TXLARB_SIZE                equ 0001h
B1CON_RXRTRRO_TXLARB_LENGTH              equ 0001h
B1CON_RXRTRRO_TXLARB_MASK                equ 0020h
B1CON_RXM1_TXABT_POSN                    equ 0006h
B1CON_RXM1_TXABT_POSITION                equ 0006h
B1CON_RXM1_TXABT_SIZE                    equ 0001h
B1CON_RXM1_TXABT_LENGTH                  equ 0001h
B1CON_RXM1_TXABT_MASK                    equ 0040h
B1CON_RXFUL_TXBIF_POSN                   equ 0007h
B1CON_RXFUL_TXBIF_POSITION               equ 0007h
B1CON_RXFUL_TXBIF_SIZE                   equ 0001h
B1CON_RXFUL_TXBIF_LENGTH                 equ 0001h
B1CON_RXFUL_TXBIF_MASK                   equ 0080h
B1CON_FILHIT0_POSN                       equ 0000h
B1CON_FILHIT0_POSITION                   equ 0000h
B1CON_FILHIT0_SIZE                       equ 0001h
B1CON_FILHIT0_LENGTH                     equ 0001h
B1CON_FILHIT0_MASK                       equ 0001h
B1CON_FILHIT1_POSN                       equ 0001h
B1CON_FILHIT1_POSITION                   equ 0001h
B1CON_FILHIT1_SIZE                       equ 0001h
B1CON_FILHIT1_LENGTH                     equ 0001h
B1CON_FILHIT1_MASK                       equ 0002h
B1CON_FILHIT2_POSN                       equ 0002h
B1CON_FILHIT2_POSITION                   equ 0002h
B1CON_FILHIT2_SIZE                       equ 0001h
B1CON_FILHIT2_LENGTH                     equ 0001h
B1CON_FILHIT2_MASK                       equ 0004h
B1CON_FILHIT3_POSN                       equ 0003h
B1CON_FILHIT3_POSITION                   equ 0003h
B1CON_FILHIT3_SIZE                       equ 0001h
B1CON_FILHIT3_LENGTH                     equ 0001h
B1CON_FILHIT3_MASK                       equ 0008h
B1CON_FILHIT4_POSN                       equ 0004h
B1CON_FILHIT4_POSITION                   equ 0004h
B1CON_FILHIT4_SIZE                       equ 0001h
B1CON_FILHIT4_LENGTH                     equ 0001h
B1CON_FILHIT4_MASK                       equ 0010h
B1CON_RTRRO_POSN                         equ 0005h
B1CON_RTRRO_POSITION                     equ 0005h
B1CON_RTRRO_SIZE                         equ 0001h
B1CON_RTRRO_LENGTH                       equ 0001h
B1CON_RTRRO_MASK                         equ 0020h
B1CON_RXM1_POSN                          equ 0006h
B1CON_RXM1_POSITION                      equ 0006h
B1CON_RXM1_SIZE                          equ 0001h
B1CON_RXM1_LENGTH                        equ 0001h
B1CON_RXM1_MASK                          equ 0040h
B1CON_RXFUL_POSN                         equ 0007h
B1CON_RXFUL_POSITION                     equ 0007h
B1CON_RXFUL_SIZE                         equ 0001h
B1CON_RXFUL_LENGTH                       equ 0001h
B1CON_RXFUL_MASK                         equ 0080h
B1CON_TXPRI0_POSN                        equ 0000h
B1CON_TXPRI0_POSITION                    equ 0000h
B1CON_TXPRI0_SIZE                        equ 0001h
B1CON_TXPRI0_LENGTH                      equ 0001h
B1CON_TXPRI0_MASK                        equ 0001h
B1CON_TXPRI1_POSN                        equ 0001h
B1CON_TXPRI1_POSITION                    equ 0001h
B1CON_TXPRI1_SIZE                        equ 0001h
B1CON_TXPRI1_LENGTH                      equ 0001h
B1CON_TXPRI1_MASK                        equ 0002h
B1CON_RTREN_POSN                         equ 0002h
B1CON_RTREN_POSITION                     equ 0002h
B1CON_RTREN_SIZE                         equ 0001h
B1CON_RTREN_LENGTH                       equ 0001h
B1CON_RTREN_MASK                         equ 0004h
B1CON_TXREQ_POSN                         equ 0003h
B1CON_TXREQ_POSITION                     equ 0003h
B1CON_TXREQ_SIZE                         equ 0001h
B1CON_TXREQ_LENGTH                       equ 0001h
B1CON_TXREQ_MASK                         equ 0008h
B1CON_TXERR_POSN                         equ 0004h
B1CON_TXERR_POSITION                     equ 0004h
B1CON_TXERR_SIZE                         equ 0001h
B1CON_TXERR_LENGTH                       equ 0001h
B1CON_TXERR_MASK                         equ 0010h
B1CON_TXLARB_POSN                        equ 0005h
B1CON_TXLARB_POSITION                    equ 0005h
B1CON_TXLARB_SIZE                        equ 0001h
B1CON_TXLARB_LENGTH                      equ 0001h
B1CON_TXLARB_MASK                        equ 0020h
B1CON_TXABT_POSN                         equ 0006h
B1CON_TXABT_POSITION                     equ 0006h
B1CON_TXABT_SIZE                         equ 0001h
B1CON_TXABT_LENGTH                       equ 0001h
B1CON_TXABT_MASK                         equ 0040h
B1CON_TXBIF_POSN                         equ 0007h
B1CON_TXBIF_POSITION                     equ 0007h
B1CON_TXBIF_SIZE                         equ 0001h
B1CON_TXBIF_LENGTH                       equ 0001h
B1CON_TXBIF_MASK                         equ 0080h
B1CON_RXRTRRO_POSN                       equ 0005h
B1CON_RXRTRRO_POSITION                   equ 0005h
B1CON_RXRTRRO_SIZE                       equ 0001h
B1CON_RXRTRRO_LENGTH                     equ 0001h
B1CON_RXRTRRO_MASK                       equ 0020h
B1CON_B1FILHIT0_POSN                     equ 0000h
B1CON_B1FILHIT0_POSITION                 equ 0000h
B1CON_B1FILHIT0_SIZE                     equ 0001h
B1CON_B1FILHIT0_LENGTH                   equ 0001h
B1CON_B1FILHIT0_MASK                     equ 0001h
B1CON_B1FILHIT1_POSN                     equ 0001h
B1CON_B1FILHIT1_POSITION                 equ 0001h
B1CON_B1FILHIT1_SIZE                     equ 0001h
B1CON_B1FILHIT1_LENGTH                   equ 0001h
B1CON_B1FILHIT1_MASK                     equ 0002h
B1CON_B1FILHIT2_POSN                     equ 0002h
B1CON_B1FILHIT2_POSITION                 equ 0002h
B1CON_B1FILHIT2_SIZE                     equ 0001h
B1CON_B1FILHIT2_LENGTH                   equ 0001h
B1CON_B1FILHIT2_MASK                     equ 0004h
B1CON_B1FILHIT3_POSN                     equ 0003h
B1CON_B1FILHIT3_POSITION                 equ 0003h
B1CON_B1FILHIT3_SIZE                     equ 0001h
B1CON_B1FILHIT3_LENGTH                   equ 0001h
B1CON_B1FILHIT3_MASK                     equ 0008h
B1CON_B1FILHIT4_POSN                     equ 0004h
B1CON_B1FILHIT4_POSITION                 equ 0004h
B1CON_B1FILHIT4_SIZE                     equ 0001h
B1CON_B1FILHIT4_LENGTH                   equ 0001h
B1CON_B1FILHIT4_MASK                     equ 0010h
B1CON_B1RTRRO_POSN                       equ 0005h
B1CON_B1RTRRO_POSITION                   equ 0005h
B1CON_B1RTRRO_SIZE                       equ 0001h
B1CON_B1RTRRO_LENGTH                     equ 0001h
B1CON_B1RTRRO_MASK                       equ 0020h
B1CON_B1RXM1_POSN                        equ 0006h
B1CON_B1RXM1_POSITION                    equ 0006h
B1CON_B1RXM1_SIZE                        equ 0001h
B1CON_B1RXM1_LENGTH                      equ 0001h
B1CON_B1RXM1_MASK                        equ 0040h
B1CON_B1RXFUL_POSN                       equ 0007h
B1CON_B1RXFUL_POSITION                   equ 0007h
B1CON_B1RXFUL_SIZE                       equ 0001h
B1CON_B1RXFUL_LENGTH                     equ 0001h
B1CON_B1RXFUL_MASK                       equ 0080h
B1CON_B1TXPRI0_POSN                      equ 0000h
B1CON_B1TXPRI0_POSITION                  equ 0000h
B1CON_B1TXPRI0_SIZE                      equ 0001h
B1CON_B1TXPRI0_LENGTH                    equ 0001h
B1CON_B1TXPRI0_MASK                      equ 0001h
B1CON_B1TXPRI1_POSN                      equ 0001h
B1CON_B1TXPRI1_POSITION                  equ 0001h
B1CON_B1TXPRI1_SIZE                      equ 0001h
B1CON_B1TXPRI1_LENGTH                    equ 0001h
B1CON_B1TXPRI1_MASK                      equ 0002h
B1CON_B1RTREN_POSN                       equ 0002h
B1CON_B1RTREN_POSITION                   equ 0002h
B1CON_B1RTREN_SIZE                       equ 0001h
B1CON_B1RTREN_LENGTH                     equ 0001h
B1CON_B1RTREN_MASK                       equ 0004h
B1CON_B1TXREQ_POSN                       equ 0003h
B1CON_B1TXREQ_POSITION                   equ 0003h
B1CON_B1TXREQ_SIZE                       equ 0001h
B1CON_B1TXREQ_LENGTH                     equ 0001h
B1CON_B1TXREQ_MASK                       equ 0008h
B1CON_B1TXERR_POSN                       equ 0004h
B1CON_B1TXERR_POSITION                   equ 0004h
B1CON_B1TXERR_SIZE                       equ 0001h
B1CON_B1TXERR_LENGTH                     equ 0001h
B1CON_B1TXERR_MASK                       equ 0010h
B1CON_B1TXLARB_POSN                      equ 0005h
B1CON_B1TXLARB_POSITION                  equ 0005h
B1CON_B1TXLARB_SIZE                      equ 0001h
B1CON_B1TXLARB_LENGTH                    equ 0001h
B1CON_B1TXLARB_MASK                      equ 0020h
B1CON_B1TXABT_POSN                       equ 0006h
B1CON_B1TXABT_POSITION                   equ 0006h
B1CON_B1TXABT_SIZE                       equ 0001h
B1CON_B1TXABT_LENGTH                     equ 0001h
B1CON_B1TXABT_MASK                       equ 0040h
B1CON_B1TXB3IF_POSN                      equ 0007h
B1CON_B1TXB3IF_POSITION                  equ 0007h
B1CON_B1TXB3IF_SIZE                      equ 0001h
B1CON_B1TXB3IF_LENGTH                    equ 0001h
B1CON_B1TXB3IF_MASK                      equ 0080h

