GopalSaraf/Practicals/PSDL/include/proc/pic18f2682.inc
// Register: B1D0
#define B1D0 B1D0
B1D0                                     equ 0E36h
// bitfield definitions
B1D0_B1D00_POSN                          equ 0000h
B1D0_B1D00_POSITION                      equ 0000h
B1D0_B1D00_SIZE                          equ 0001h
B1D0_B1D00_LENGTH                        equ 0001h
B1D0_B1D00_MASK                          equ 0001h
B1D0_B1D01_POSN                          equ 0001h
B1D0_B1D01_POSITION                      equ 0001h
B1D0_B1D01_SIZE                          equ 0001h
B1D0_B1D01_LENGTH                        equ 0001h
B1D0_B1D01_MASK                          equ 0002h
B1D0_B1D02_POSN                          equ 0002h
B1D0_B1D02_POSITION                      equ 0002h
B1D0_B1D02_SIZE                          equ 0001h
B1D0_B1D02_LENGTH                        equ 0001h
B1D0_B1D02_MASK                          equ 0004h
B1D0_B1D03_POSN                          equ 0003h
B1D0_B1D03_POSITION                      equ 0003h
B1D0_B1D03_SIZE                          equ 0001h
B1D0_B1D03_LENGTH                        equ 0001h
B1D0_B1D03_MASK                          equ 0008h
B1D0_B1D04_POSN                          equ 0004h
B1D0_B1D04_POSITION                      equ 0004h
B1D0_B1D04_SIZE                          equ 0001h
B1D0_B1D04_LENGTH                        equ 0001h
B1D0_B1D04_MASK                          equ 0010h
B1D0_B1D05_POSN                          equ 0005h
B1D0_B1D05_POSITION                      equ 0005h
B1D0_B1D05_SIZE                          equ 0001h
B1D0_B1D05_LENGTH                        equ 0001h
B1D0_B1D05_MASK                          equ 0020h
B1D0_B1D06_POSN                          equ 0006h
B1D0_B1D06_POSITION                      equ 0006h
B1D0_B1D06_SIZE                          equ 0001h
B1D0_B1D06_LENGTH                        equ 0001h
B1D0_B1D06_MASK                          equ 0040h
B1D0_B1D07_POSN                          equ 0007h
B1D0_B1D07_POSITION                      equ 0007h
B1D0_B1D07_SIZE                          equ 0001h
B1D0_B1D07_LENGTH                        equ 0001h
B1D0_B1D07_MASK                          equ 0080h

// Register: B1D1
#define B1D1 B1D1
B1D1                                     equ 0E37h
// bitfield definitions
B1D1_B1D10_POSN                          equ 0000h
B1D1_B1D10_POSITION                      equ 0000h
B1D1_B1D10_SIZE                          equ 0001h
B1D1_B1D10_LENGTH                        equ 0001h
B1D1_B1D10_MASK                          equ 0001h
B1D1_B1D11_POSN                          equ 0001h
B1D1_B1D11_POSITION                      equ 0001h
B1D1_B1D11_SIZE                          equ 0001h
B1D1_B1D11_LENGTH                        equ 0001h
B1D1_B1D11_MASK                          equ 0002h
B1D1_B1D12_POSN                          equ 0002h
B1D1_B1D12_POSITION                      equ 0002h
B1D1_B1D12_SIZE                          equ 0001h
B1D1_B1D12_LENGTH                        equ 0001h
B1D1_B1D12_MASK                          equ 0004h
B1D1_B1D13_POSN                          equ 0003h
B1D1_B1D13_POSITION                      equ 0003h
B1D1_B1D13_SIZE                          equ 0001h
B1D1_B1D13_LENGTH                        equ 0001h
B1D1_B1D13_MASK                          equ 0008h
B1D1_B1D14_POSN                          equ 0004h
B1D1_B1D14_POSITION                      equ 0004h
B1D1_B1D14_SIZE                          equ 0001h
B1D1_B1D14_LENGTH                        equ 0001h
B1D1_B1D14_MASK                          equ 0010h
B1D1_B1D15_POSN                          equ 0005h
B1D1_B1D15_POSITION                      equ 0005h
B1D1_B1D15_SIZE                          equ 0001h
B1D1_B1D15_LENGTH                        equ 0001h
B1D1_B1D15_MASK                          equ 0020h
B1D1_B1D16_POSN                          equ 0006h
B1D1_B1D16_POSITION                      equ 0006h
B1D1_B1D16_SIZE                          equ 0001h
B1D1_B1D16_LENGTH                        equ 0001h
B1D1_B1D16_MASK                          equ 0040h
B1D1_B1D17_POSN                          equ 0007h
B1D1_B1D17_POSITION                      equ 0007h
B1D1_B1D17_SIZE                          equ 0001h
B1D1_B1D17_LENGTH                        equ 0001h
B1D1_B1D17_MASK                          equ 0080h

// Register: B1D2
#define B1D2 B1D2
B1D2                                     equ 0E38h
// bitfield definitions
B1D2_B1D20_POSN                          equ 0000h
B1D2_B1D20_POSITION                      equ 0000h
B1D2_B1D20_SIZE                          equ 0001h
B1D2_B1D20_LENGTH                        equ 0001h
B1D2_B1D20_MASK                          equ 0001h
B1D2_B1D21_POSN                          equ 0001h
B1D2_B1D21_POSITION                      equ 0001h
B1D2_B1D21_SIZE                          equ 0001h
B1D2_B1D21_LENGTH                        equ 0001h
B1D2_B1D21_MASK                          equ 0002h
B1D2_B1D22_POSN                          equ 0002h
B1D2_B1D22_POSITION                      equ 0002h
B1D2_B1D22_SIZE                          equ 0001h
B1D2_B1D22_LENGTH                        equ 0001h
B1D2_B1D22_MASK                          equ 0004h
B1D2_B1D23_POSN                          equ 0003h
B1D2_B1D23_POSITION                      equ 0003h
B1D2_B1D23_SIZE                          equ 0001h
B1D2_B1D23_LENGTH                        equ 0001h
B1D2_B1D23_MASK                          equ 0008h
B1D2_B1D24_POSN                          equ 0004h
B1D2_B1D24_POSITION                      equ 0004h
B1D2_B1D24_SIZE                          equ 0001h
B1D2_B1D24_LENGTH                        equ 0001h
B1D2_B1D24_MASK                          equ 0010h
B1D2_B1D25_POSN                          equ 0005h
B1D2_B1D25_POSITION                      equ 0005h
B1D2_B1D25_SIZE                          equ 0001h
B1D2_B1D25_LENGTH                        equ 0001h
B1D2_B1D25_MASK                          equ 0020h
B1D2_B1D26_POSN                          equ 0006h
B1D2_B1D26_POSITION                      equ 0006h
B1D2_B1D26_SIZE                          equ 0001h
B1D2_B1D26_LENGTH                        equ 0001h
B1D2_B1D26_MASK                          equ 0040h
B1D2_B1D27_POSN                          equ 0007h
B1D2_B1D27_POSITION                      equ 0007h
B1D2_B1D27_SIZE                          equ 0001h
B1D2_B1D27_LENGTH                        equ 0001h
B1D2_B1D27_MASK                          equ 0080h

// Register: B1D3
#define B1D3 B1D3
B1D3                                     equ 0E39h
// bitfield definitions
B1D3_B1D30_POSN                          equ 0000h
B1D3_B1D30_POSITION                      equ 0000h
B1D3_B1D30_SIZE                          equ 0001h
B1D3_B1D30_LENGTH                        equ 0001h
B1D3_B1D30_MASK                          equ 0001h
B1D3_B1D31_POSN                          equ 0001h
B1D3_B1D31_POSITION                      equ 0001h
B1D3_B1D31_SIZE                          equ 0001h
B1D3_B1D31_LENGTH                        equ 0001h
B1D3_B1D31_MASK                          equ 0002h
B1D3_B1D32_POSN                          equ 0002h
B1D3_B1D32_POSITION                      equ 0002h
B1D3_B1D32_SIZE                          equ 0001h
B1D3_B1D32_LENGTH                        equ 0001h
B1D3_B1D32_MASK                          equ 0004h
B1D3_B1D33_POSN                          equ 0003h
B1D3_B1D33_POSITION                      equ 0003h
B1D3_B1D33_SIZE                          equ 0001h
B1D3_B1D33_LENGTH                        equ 0001h
B1D3_B1D33_MASK                          equ 0008h
B1D3_B1D34_POSN                          equ 0004h
B1D3_B1D34_POSITION                      equ 0004h
B1D3_B1D34_SIZE                          equ 0001h
B1D3_B1D34_LENGTH                        equ 0001h
B1D3_B1D34_MASK                          equ 0010h
B1D3_B1D35_POSN                          equ 0005h
B1D3_B1D35_POSITION                      equ 0005h
B1D3_B1D35_SIZE                          equ 0001h
B1D3_B1D35_LENGTH                        equ 0001h
B1D3_B1D35_MASK                          equ 0020h
B1D3_B1D36_POSN                          equ 0006h
B1D3_B1D36_POSITION                      equ 0006h
B1D3_B1D36_SIZE                          equ 0001h
B1D3_B1D36_LENGTH                        equ 0001h
B1D3_B1D36_MASK                          equ 0040h
B1D3_B1D37_POSN                          equ 0007h
B1D3_B1D37_POSITION                      equ 0007h
B1D3_B1D37_SIZE                          equ 0001h
B1D3_B1D37_LENGTH                        equ 0001h
B1D3_B1D37_MASK                          equ 0080h

// Register: B1D4
#define B1D4 B1D4
B1D4                                     equ 0E3Ah
// bitfield definitions
B1D4_B1D40_POSN                          equ 0000h
B1D4_B1D40_POSITION                      equ 0000h
B1D4_B1D40_SIZE                          equ 0001h
B1D4_B1D40_LENGTH                        equ 0001h
B1D4_B1D40_MASK                          equ 0001h
B1D4_B1D41_POSN                          equ 0001h
B1D4_B1D41_POSITION                      equ 0001h
B1D4_B1D41_SIZE                          equ 0001h
B1D4_B1D41_LENGTH                        equ 0001h
B1D4_B1D41_MASK                          equ 0002h
B1D4_B1D42_POSN                          equ 0002h
B1D4_B1D42_POSITION                      equ 0002h
B1D4_B1D42_SIZE                          equ 0001h
B1D4_B1D42_LENGTH                        equ 0001h
B1D4_B1D42_MASK                          equ 0004h
B1D4_B1D43_POSN                          equ 0003h
B1D4_B1D43_POSITION                      equ 0003h
B1D4_B1D43_SIZE                          equ 0001h
B1D4_B1D43_LENGTH                        equ 0001h
B1D4_B1D43_MASK                          equ 0008h
B1D4_B1D44_POSN                          equ 0004h
B1D4_B1D44_POSITION                      equ 0004h
B1D4_B1D44_SIZE                          equ 0001h
B1D4_B1D44_LENGTH                        equ 0001h
B1D4_B1D44_MASK                          equ 0010h
B1D4_B1D45_POSN                          equ 0005h
B1D4_B1D45_POSITION                      equ 0005h
B1D4_B1D45_SIZE                          equ 0001h
B1D4_B1D45_LENGTH                        equ 0001h
B1D4_B1D45_MASK                          equ 0020h
B1D4_B1D46_POSN                          equ 0006h
B1D4_B1D46_POSITION                      equ 0006h
B1D4_B1D46_SIZE                          equ 0001h
B1D4_B1D46_LENGTH                        equ 0001h
B1D4_B1D46_MASK                          equ 0040h
B1D4_B1D47_POSN                          equ 0007h
B1D4_B1D47_POSITION                      equ 0007h
B1D4_B1D47_SIZE                          equ 0001h
B1D4_B1D47_LENGTH                        equ 0001h
B1D4_B1D47_MASK                          equ 0080h

// Register: B1D5
#define B1D5 B1D5
B1D5                                     equ 0E3Bh
// bitfield definitions
B1D5_B1D50_POSN                          equ 0000h
B1D5_B1D50_POSITION                      equ 0000h
B1D5_B1D50_SIZE                          equ 0001h
B1D5_B1D50_LENGTH                        equ 0001h
B1D5_B1D50_MASK                          equ 0001h
B1D5_B1D51_POSN                          equ 0001h
B1D5_B1D51_POSITION                      equ 0001h
B1D5_B1D51_SIZE                          equ 0001h
B1D5_B1D51_LENGTH                        equ 0001h
B1D5_B1D51_MASK                          equ 0002h
B1D5_B1D52_POSN                          equ 0002h
B1D5_B1D52_POSITION                      equ 0002h
B1D5_B1D52_SIZE                          equ 0001h
B1D5_B1D52_LENGTH                        equ 0001h
B1D5_B1D52_MASK                          equ 0004h
B1D5_B1D53_POSN                          equ 0003h
B1D5_B1D53_POSITION                      equ 0003h
B1D5_B1D53_SIZE                          equ 0001h
B1D5_B1D53_LENGTH                        equ 0001h
B1D5_B1D53_MASK                          equ 0008h
B1D5_B1D54_POSN                          equ 0004h
B1D5_B1D54_POSITION                      equ 0004h
B1D5_B1D54_SIZE                          equ 0001h
B1D5_B1D54_LENGTH                        equ 0001h
B1D5_B1D54_MASK                          equ 0010h
B1D5_B1D55_POSN                          equ 0005h
B1D5_B1D55_POSITION                      equ 0005h
B1D5_B1D55_SIZE                          equ 0001h
B1D5_B1D55_LENGTH                        equ 0001h
B1D5_B1D55_MASK                          equ 0020h
B1D5_B1D56_POSN                          equ 0006h
B1D5_B1D56_POSITION                      equ 0006h
B1D5_B1D56_SIZE                          equ 0001h
B1D5_B1D56_LENGTH                        equ 0001h
B1D5_B1D56_MASK                          equ 0040h
B1D5_B1D57_POSN                          equ 0007h
B1D5_B1D57_POSITION                      equ 0007h
B1D5_B1D57_SIZE                          equ 0001h
B1D5_B1D57_LENGTH                        equ 0001h
B1D5_B1D57_MASK                          equ 0080h

// Register: B1D6
#define B1D6 B1D6
B1D6                                     equ 0E3Ch
// bitfield definitions
B1D6_B1D60_POSN                          equ 0000h
B1D6_B1D60_POSITION                      equ 0000h
B1D6_B1D60_SIZE                          equ 0001h
B1D6_B1D60_LENGTH                        equ 0001h
B1D6_B1D60_MASK                          equ 0001h
B1D6_B1D61_POSN                          equ 0001h
B1D6_B1D61_POSITION                      equ 0001h
B1D6_B1D61_SIZE                          equ 0001h
B1D6_B1D61_LENGTH                        equ 0001h
B1D6_B1D61_MASK                          equ 0002h
B1D6_B1D62_POSN                          equ 0002h
B1D6_B1D62_POSITION                      equ 0002h
B1D6_B1D62_SIZE                          equ 0001h
B1D6_B1D62_LENGTH                        equ 0001h
B1D6_B1D62_MASK                          equ 0004h
B1D6_B1D63_POSN                          equ 0003h
B1D6_B1D63_POSITION                      equ 0003h
B1D6_B1D63_SIZE                          equ 0001h
B1D6_B1D63_LENGTH                        equ 0001h
B1D6_B1D63_MASK                          equ 0008h
B1D6_B1D64_POSN                          equ 0004h
B1D6_B1D64_POSITION                      equ 0004h
B1D6_B1D64_SIZE                          equ 0001h
B1D6_B1D64_LENGTH                        equ 0001h
B1D6_B1D64_MASK                          equ 0010h
B1D6_B1D65_POSN                          equ 0005h
B1D6_B1D65_POSITION                      equ 0005h
B1D6_B1D65_SIZE                          equ 0001h
B1D6_B1D65_LENGTH                        equ 0001h
B1D6_B1D65_MASK                          equ 0020h
B1D6_B1D66_POSN                          equ 0006h
B1D6_B1D66_POSITION                      equ 0006h
B1D6_B1D66_SIZE                          equ 0001h
B1D6_B1D66_LENGTH                        equ 0001h
B1D6_B1D66_MASK                          equ 0040h
B1D6_B1D67_POSN                          equ 0007h
B1D6_B1D67_POSITION                      equ 0007h
B1D6_B1D67_SIZE                          equ 0001h
B1D6_B1D67_LENGTH                        equ 0001h
B1D6_B1D67_MASK                          equ 0080h

// Register: B1D7
#define B1D7 B1D7
B1D7                                     equ 0E3Dh
// bitfield definitions
B1D7_B1D70_POSN                          equ 0000h
B1D7_B1D70_POSITION                      equ 0000h
B1D7_B1D70_SIZE                          equ 0001h
B1D7_B1D70_LENGTH                        equ 0001h
B1D7_B1D70_MASK                          equ 0001h
B1D7_B1D71_POSN                          equ 0001h
B1D7_B1D71_POSITION                      equ 0001h
B1D7_B1D71_SIZE                          equ 0001h
B1D7_B1D71_LENGTH                        equ 0001h
B1D7_B1D71_MASK                          equ 0002h
B1D7_B1D72_POSN                          equ 0002h
B1D7_B1D72_POSITION                      equ 0002h
B1D7_B1D72_SIZE                          equ 0001h
B1D7_B1D72_LENGTH                        equ 0001h
B1D7_B1D72_MASK                          equ 0004h
B1D7_B1D73_POSN                          equ 0003h
B1D7_B1D73_POSITION                      equ 0003h
B1D7_B1D73_SIZE                          equ 0001h
B1D7_B1D73_LENGTH                        equ 0001h
B1D7_B1D73_MASK                          equ 0008h
B1D7_B1D74_POSN                          equ 0004h
B1D7_B1D74_POSITION                      equ 0004h
B1D7_B1D74_SIZE                          equ 0001h
B1D7_B1D74_LENGTH                        equ 0001h
B1D7_B1D74_MASK                          equ 0010h
B1D7_B1D75_POSN                          equ 0005h
B1D7_B1D75_POSITION                      equ 0005h
B1D7_B1D75_SIZE                          equ 0001h
B1D7_B1D75_LENGTH                        equ 0001h
B1D7_B1D75_MASK                          equ 0020h
B1D7_B1D76_POSN                          equ 0006h
B1D7_B1D76_POSITION                      equ 0006h
B1D7_B1D76_SIZE                          equ 0001h
B1D7_B1D76_LENGTH                        equ 0001h
B1D7_B1D76_MASK                          equ 0040h
B1D7_B1D77_POSN                          equ 0007h
B1D7_B1D77_POSITION                      equ 0007h
B1D7_B1D77_SIZE                          equ 0001h
B1D7_B1D77_LENGTH                        equ 0001h
B1D7_B1D77_MASK                          equ 0080h

